Revit 2027 API
PointOnPlane.NewPointOnPlane Method
Construct a PointOnPlane given a reference and a location in space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PointOnPlane NewPointOnPlane(
	Document doc,
	Reference planeReference,
	XYZ position,
	XYZ xvec
)
Public Shared Function NewPointOnPlane (
	doc As Document,
	planeReference As Reference,
	position As XYZ,
	xvec As XYZ
) As PointOnPlane
public:
static PointOnPlane^ NewPointOnPlane(
	Document^ doc,
	Reference^ planeReference,
	XYZ^ position,
	XYZ^ xvec
)
static member NewPointOnPlane :
        doc : Document *
        planeReference : Reference *
        position : XYZ *
        xvec : XYZ -> PointOnPlane
Parameters
doc Document
The document containing the plane reference.
planeReference Reference
position XYZ
A 3-dimensional position.
xvec XYZ
The direction of the point's X-coordinate vector in the plane's coordinates. Optional; default value is the X-coordinate vector of the plane.
Return Value
PointOnPlane
A new PointOnPlane object with 2-dimensional Position, XVec, and Offset properties set to match the given 3-dimensional arguments.
See Also
Reference
PointOnPlane Class
Autodesk.Revit.DB Namespace